**`teams/nomis/windows_server_2022_jumpserver`** terraform plan on `push` event [#512](${url})

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder["windows_server_2022_jumpserver"].aws_imagebuilder_component.this["../components/windows_server_2022_jumpserver/jumpserver.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver/1.0.9/1"
        name                  = "Jumpserver"
      ~ tags                  = {
          ~ "github-actor"                            = "dominicrobinson-moj" -> "jnq"
            # (15 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "github-actor"                            = "dominicrobinson-moj" -> "jnq"
            # (15 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.imagebuilder["windows_server_2022_jumpserver"].aws_imagebuilder_component.this["../components/windows_server_2022_jumpserver/prometheus_windows_exporter.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/prometheuswindowsexporter/1.0.7/1"
        name                  = "PrometheusWindowsExporter"
      ~ tags                  = {
          ~ "github-actor"                            = "dominicrobinson-moj" -> "jnq"
            # (15 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "github-actor"                            = "dominicrobinson-moj" -> "jnq"
            # (15 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.imagebuilder["windows_server_2022_jumpserver"].aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-windows-server-2022-jumpserver"
        name         = "nomis_windows_server_2022_jumpserver"
      ~ tags         = {
          ~ "github-actor"                            = "dominicrobinson-moj" -> "jnq"
            # (15 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "github-actor"                            = "dominicrobinson-moj" -> "jnq"
            # (15 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder["windows_server_2022_jumpserver"].aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-windows-server-2022-jumpserver" -> (known after apply)
      ~ date_created                     = "2022-09-14T14:35:32.956Z" -> (known after apply)
      ~ date_last_run                    = "2022-09-14T14:39:10.795Z" -> (known after apply)
      ~ date_next_run                    = "2022-10-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2022-09-14T14:35:32.956Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-windows-server-2022-jumpserver" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2022-jumpserver/0.0.2" -> (known after apply) # forces replacement
        name                             = "nomis_windows_server_2022_jumpserver"
      ~ platform                         = "Windows" -> (known after apply)
      ~ tags                             = {
          ~ "github-actor"                            = "dominicrobinson-moj" -> "jnq"
            # (15 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "github-actor"                            = "dominicrobinson-moj" -> "jnq"
            # (15 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)


      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.imagebuilder["windows_server_2022_jumpserver"].aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2022-jumpserver/0.0.2" -> (known after apply)
      ~ date_created     = "2022-09-14T14:35:31.285Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2022-jumpserver/0.0.2" -> (known after apply)
        name             = "nomis_windows_server_2022_jumpserver"
      ~ owner            = "374269020027" -> (known after apply)
      ~ platform         = "Windows" -> (known after apply)
      ~ tags             = {
          ~ "github-actor"                            = "dominicrobinson-moj" -> "jnq"
            # (15 unchanged elements hidden)
        }
      ~ tags_all         = {
          ~ "github-actor"                            = "dominicrobinson-moj" -> "jnq"
            # (15 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
        # (3 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver/1.0.9/1" -> "arn:aws:imagebuilder:eu-west-2:374269020027:component/prometheuswindowsexporter/1.0.7/1" # forces replacement
        }
      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/prometheuswindowsexporter/1.0.7/1" -> "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver/1.0.9/1" # forces replacement
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

  # module.imagebuilder["windows_server_2022_jumpserver"].aws_imagebuilder_infrastructure_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_infrastructure_configuration" "this" {
        id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2022-jumpserver-0-0-2"
        name                          = "nomis_windows_server_2022_jumpserver_0_0_2"
      ~ resource_tags                 = {
          ~ "github-actor"                            = "dominicrobinson-moj" -> "jnq"
            # (15 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "github-actor"                            = "dominicrobinson-moj" -> "jnq"
            # (15 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "github-actor"                            = "dominicrobinson-moj" -> "jnq"
            # (15 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 4 to change, 2 to destroy.

Warning: Experimental feature "module_variable_optional_attrs" is active

  on ../modules/imagebuilder/versions.tf line 2, in terraform:
   2:   experiments = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

```